class Data:
    questions = [
        [1, 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'],
        [2, 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'],
        [3, 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'],
        [4, 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'],
        [5, 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'],
        [6, 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'],
        [7, 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'],
        [8, 'Да, обязательно. Всем самокатов! И Москве, и Московской области.']
    ]

TEST_DATA = [
    {
        "first_name": "Иван",
        "last_name": "Никитин",
        "address": "ул. Усачева, 10",
        "metro": "Черкизовская",
        "phone": "89998887654",
        "date": "01.05.2025",
        "period": "сутки",
        "color": "black",
        "comment": "Не звонить"
    }
]

TEST_DATA2 = [
    {
        "first_name": "Никита",
        "last_name": "Иванов",
        "address": "ул. Васильева, 10",
        "metro": "Сокольники",
        "phone": "89876541234",
        "date": "27.04.2025",
        "period": "трое суток",
        "color": "grey",
        "comment": "Позвоните за час"
    }
]
